app/models/shortened_url.rb

  def self.random_code
    shorturl = nil
    until !shorturl.nil? && !self.exists?(short_url: shorturl)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "tlSJuAoUhQH8AaYyedBEsw=="], ["LIMIT", 1]]

  def num_recent_uniques
    visits.where({ updated_at: 10.minutes.ago..Time.now }).select(:user_id).distinct.count
---
SELECT COUNT(*) FROM "shortened_urls" WHERE "shortened_urls"."user_id" = $1 AND "shortened_urls"."created_at" BETWEEN $2 AND $3  [["user_id", 1], ["created_at", "2019-03-27 15:37:39.939922"], ["created_at", "2019-03-27 15:38:39.939955"]]

  def self.prune(n)
    ShortenedURL.all.where.not({ created_at: n.minute.ago..Time.now }).joins("LEFT JOIN visits on visits.url_id = shortened_urls.id").group("shortened_urls.id").having("COUNT(visits.url_id) = 0").destroy_all
    ShortenedURL.all.joins("JOIN visits on visits.url_id = shortened_urls.id").where.not(visits: { created_at: n.minute.ago..Time.now }).destroy_all
---
DELETE FROM "shortened_urls" WHERE "shortened_urls"."id" = $1  [["id", 2]]
SELECT "shortened_urls".* FROM "shortened_urls" LEFT JOIN visits on visits.url_id = shortened_urls.id WHERE NOT ("shortened_urls"."created_at" BETWEEN $1 AND $2) GROUP BY shortened_urls.id HAVING (COUNT(visits.url_id) = 0)  [["created_at", "2019-03-28 16:56:48.435578"], ["created_at", "2019-03-28 17:36:48.435615"]]
DELETE FROM "shortened_urls" WHERE "shortened_urls"."id" = $1  [["id", 3]]
DELETE FROM "visits" WHERE "visits"."id" = $1  [["id", 1]]
SELECT "shortened_urls".* FROM "shortened_urls" JOIN visits on visits.url_id = shortened_urls.id WHERE NOT ("visits"."created_at" BETWEEN $1 AND $2)  [["created_at", "2019-03-28 16:56:48.531631"], ["created_at", "2019-03-28 17:36:48.531698"]]