app/models/user.rb

  def create_short_url(longurl)
    ShortenedURL.create!(short_url: ShortenedURL.random_code, long_url: longurl, user_id: self.id)
---
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "jpell3130@gmail.com"], ["created_at", "2019-03-22 16:27:30.842021"], ["updated_at", "2019-03-22 16:27:30.842021"]]
INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "5iC78xISr8ws+lRfNubOxw=="], ["long_url", "www.google.com"], ["user_id", 1], ["created_at", "2019-03-25 17:48:12.935289"], ["updated_at", "2019-03-25 17:48:12.935289"]]