app/models/visit.rb

  def self.record_visit!(user, url)
    self.create!(user_id: user, url_id: url)
---
INSERT INTO "visits" ("user_id", "url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["url_id", 2], ["created_at", "2019-03-20 17:30:28.489977"], ["updated_at", "2019-03-20 17:30:28.489977"]]